---
kind: type
id: T:Autodesk.Revit.DB.InternalOrigin
source: html/61a029d2-81db-72c9-8fe6-f83d0aa0c658.htm
---
# Autodesk.Revit.DB.InternalOrigin

A class representing the origin of internal coordinate system.
 Each Revit project contains one InternalOrigin.

## Syntax (C#)
```csharp
public class InternalOrigin : Element
```

## Remarks
The internal origin cannot be selected (e.g. as a reference) nor can it be modified.